Revit 2027 API
BuiltInFailures.EditingFailures.TemporaryChangesOutOfDate Property
 You must Reload Latest before editing the element. Changes will be temporary, and will not be saved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TemporaryChangesOutOfDate { get; }
Public Shared ReadOnly Property TemporaryChangesOutOfDate As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TemporaryChangesOutOfDate {
	FailureDefinitionId^ get ();
}
static member TemporaryChangesOutOfDate : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace